public class Main {

    public static void main(String[] args) {
        Container container = new Container();
        container.addCount(5672);
        System.out.println(container.getCount());

        //  ниже напишите код для выполнения задания:
        //  С помощью цикла и преобразования чисел в символы найдите все коды
        //  букв русского алфавита — заглавных и строчных, в том числе буквы Ё.

        for (int i = 0; i < 65536; i++) {
            char c = (char) i;
            if (c == 'а' || c == 'А' ||
                    c == 'б' || c == 'Б' ||
                    c == 'в' || c == 'В' ||
                    c == 'г' || c == 'Г' ||
                    c == 'д' || c == 'Д' ||
                    c == 'е' || c == 'Е' ||
                    c == 'ё' || c == 'Ё' ||
                    c == 'ж' || c == 'Ж' ||
                    c == 'з' || c == 'З' ||
                    c == 'и' || c == 'И' ||
                    c == 'й' || c == 'Й' ||
                    c == 'к' || c == 'К' ||
                    c == 'л' || c == 'Л' ||
                    c == 'м' || c == 'М' ||
                    c == 'н' || c == 'Н' ||
                    c == 'о' || c == 'О' ||
                    c == 'п' || c == 'П' ||
                    c == 'р' || c == 'Р' ||
                    c == 'с' || c == 'С' ||
                    c == 'т' || c == 'Т' ||
                    c == 'у' || c == 'У' ||
                    c == 'ф' || c == 'Ф' ||
                    c == 'х' || c == 'Х' ||
                    c == 'ц' || c == 'Ц' ||
                    c == 'ч' || c == 'Ч' ||
                    c == 'ш' || c == 'Ш' ||
                    c == 'щ' || c == 'Щ' ||
                    c == 'ъ' || c == 'Ъ' ||
                    c == 'ы' || c == 'Ы' ||
                    c == 'ь' || c == 'Ь' ||
                    c == 'э' || c == 'Э' ||
                    c == 'ю' || c == 'Ю' ||
                    c == 'я' || c == 'Я' ) {
                System.out.println(i + " - " + c);
            }
        }
    }
}
